////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////
//
//
//
//
////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////




var mainSlider = (function () {
	// Инициализация
	var init = function () {
			_setUpListners();
		};

	// _setUpListners - прослушка
	var _setUpListners = function (){

		};

  // Объявление переменных
  var
      doc = $(document), // сохраняем документ в переменныю doc
      slider = doc.find('#mainSlider'), // находим слайдер
      view = slider.find('#mainSliderView'), // видемая часть слайдера
      imgBox = slider.find('#mainSliderImgBox'), // набор со списком изображений
      imgList = imgBox.find('.main-slider_img-list'), // список слайдов
      imgW = imgList.width(), // ширина одного слайда
      boxW = imgBox.width(), // ширина контейнера со сладйерами
      boxLeft = imgBox.position().left; // положение контейнера относительно левого края

  console.log(boxLeft);


return {
			init: init
		};

})();
